<?php
    //Задание 1//
    echo "Задание 1<br>";
    $var = "hello";
    echo $var[0].$var[1].$var[4];
    echo "<br>-------------------------------------";

    //Задание 2//
    echo "<br>Задание 2<br>";
    echo 60*60;
    echo "<br>-------------------------------------";

    //Задание 3//
    echo "<br>Задание 3<br>";
    $var = 1;
    $var += 12;
    $var -= 14;
    $var *= 5;
    $var /= 7;
    $var++;
    $var--;
    echo $var;

    echo "<br>-------------------------------------";

    //Задание 4//
    echo "<br>Задание 4<br>";
    $a = 3;
    echo $a;
    echo "<br>-------------------------------------";

    //Задание 5//
    echo "<br>Задание 5<br>";
    $a = 10;
    $b = 2;
    echo $a + $b;
    echo "<br>";
    echo $a - $b;
    echo "<br>";
    echo $a * $b;
    echo "<br>";
    echo $a / $b;
    echo "<br>-------------------------------------";

    //Задание 6//
    echo "<br>Задание 6<br>";
    $c = 15;
    $d = 2;
    $result = $c + $d;
    echo $result;
    echo "<br>-------------------------------------";

    //Задание 7//
    echo "<br>Задание 7<br>";
    $a = 10;
    $b = 2;
    $c = 5;
    echo $a + $b + $c;
    echo "<br>-------------------------------------";

    //Задание 8//
    echo "<br>Задание 8<br>";
    $a = 17;
    $b = 10;
    $c = $a - $b;
    $d = 7;
    $result = $c + $d;
    echo $result;
    echo "<br>-------------------------------------";

    //Задание 9//
    echo "<br>Задание 9<br>";
    $text = 'Привет, мир!';
    echo $text;
    echo "<br>-------------------------------------";

    //Задание 10//
    echo "<br>Задание 10<br>";
    $text1='Привет,';
    $text2=' Мир!';
    echo $text1.$text2;
    echo "<br>-------------------------------------";

    //Задание 11//
    echo "<br>Задание 11<br>";
    $name = "Vladislav";
    $text1='Привет, ';
    echo $text1.$name;
    echo "<br>-------------------------------------";

    //Задание 12//
    echo "<br>Задание 12<br>";
    $age = 20;
    echo "Мне $age лет!";
    echo "<br>-------------------------------------";

    //Задание 13//
    echo "<br>Задание 13<br>";
    $text = "abcde";
    echo $text[0].$text[2].$text[4];
    echo "<br>-------------------------------------";

    //Задание 14//
    echo "<br>Задание 14<br>";
    $text = "abcde";
    $text[0] = "!";
    echo $text;
    echo "<br>-------------------------------------";

    //Задание 15//
    echo "<br>Задание 15<br>";
    $num = "12345";
    $sum = $num[0]+$num[1]+$num[2]+$num[3]+$num[4];
    echo $sum;
    echo "<br>-------------------------------------";

    //Задание 16//
    echo "<br>Задание 16<br>";
    $hour = 60*60;
    $day = $hour*24;
    $month = $day*30;
    echo $hour;
    echo "<br>";
    echo  $day;
    echo "<br>";
    echo $month;
    echo "<br>-------------------------------------";

    //Задание 17//
    echo "<br>Задание 17<br>";
    $hour = date("H")+10;
    $minute = date("i");
    $sec = date("s");
    echo "$hour:$minute:$sec";
    echo "<br>-------------------------------------";

    //Задание 18//
    echo "<br>Задание 18<br>";
    $value = 6;
    echo $value*$value;
    echo "<br>-------------------------------------";

    //Задание 19//
    echo "<br>Задание 19<br>";
    $var = 47;
    $var += 7;
    $var -= 18;
    $var *= 10;
    $var /= 20;
    echo $var;
    echo "<br>-------------------------------------";

    //Задание 20//
    echo "<br>Задание 20<br>";
    $text = 'Я';
    $text .= ' хочу';
    $text .=' знать';
    $text .=' PHP!';
    echo $text;
    echo "<br>-------------------------------------";

    //Задание 21//
    echo "<br>Задание 21<br>";
    $var = 10;
    $var++;
    $var++;
    $var--;
    echo $var;
    echo "<br>-------------------------------------";

    //Задание 22//
    echo "<br>Задание 22<br>";
    $var = 10;
    $var += 7;
    $var++;
    $var--;
    $var += 12;
    $var *= 7;
    $var -= 15;
    echo $var;
    

?>